In [1]:
import pandas as pd
import numpy as np
data = pd.DataFrame(
np.arange(16).reshape(4, 4), 
index = ['London', 'Paris', 'Berlin', 'Istanbul'], 
columns = ['one', 'two', 'three', 'four'])

print(data)

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [2]:
print(data['two'])

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int64

In [7]:
print(data[['one', 'two']])

          one  two
London      0    1
Paris       4    5
Berlin      8    9
Istanbul   12   13

In [8]:
print(data[:3])

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7
Berlin    8    9     10    11

In [9]:
print(data[data['four']>5])

          one  two  three  four
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [13]:
print(data.loc["London"])

one      0
two      1
three    2
four     3
Name: London, dtype: int64

In [14]:
data={"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],      
      "score":[90,80,85,75,95,60,65],      
      "sport":["Wrestling","Football","Skiing","Swimming","Tennis",
               "Karete","Surfing"],      
      "sex":["M","M","M","M","F","F","F"]}

In [15]:
print(data)

{'name': ['Bill', 'Tom', 'Tim', 'John', 'Alex', 'Vanessa', 'Kate'], 'score': [90, 80, 85, 75, 95, 60, 65], 'sport': ['Wrestling', 'Football', 'Skiing', 'Swimming', 'Tennis', 'Karete', 'Surfing'], 'sex': ['M', 'M', 'M', 'M', 'F', 'F', 'F']}

In [33]:
df = pd.DataFrame(data)
print(df)

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [18]:
print(df.head())

   name  score      sport sex
0  Bill     90  Wrestling   M
1   Tom     80   Football   M
2   Tim     85     Skiing   M
3  John     75   Swimming   M
4  Alex     95     Tennis   F

In [19]:
print(df.tail())

      name  score     sport sex
2      Tim     85    Skiing   M
3     John     75  Swimming   M
4     Alex     95    Tennis   F
5  Vanessa     60    Karete   F
6     Kate     65   Surfing   F

In [20]:
print(df.head(3))

   name  score      sport sex
0  Bill     90  Wrestling   M
1   Tom     80   Football   M
2   Tim     85     Skiing   M

In [21]:
print(df.tail(10))

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [25]:
print(df.shape)

(7, 4)

In [34]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   score   7 non-null      int64
 2   sport   7 non-null      object
 3   sex     7 non-null      object
dtypes: int64(1), object(3)
memory usage: 356.0+ bytes
None

In [38]:
print(df.columns)
df.rename(columns={'sex': 'gender'}, inplace=True)
print(df.columns)

Index(['name', 'score', 'sport', 'gender'], dtype='object')
Index(['name', 'score', 'sport', 'gender'], dtype='object')

In [39]:
print(df['sport'])

0    Wrestling
1     Football
2       Skiing
3     Swimming
4       Tennis
5       Karete
6      Surfing
Name: sport, dtype: object

In [40]:
my_columns = ["name", "sport"]
print(df[my_columns])

      name      sport
0     Bill  Wrestling
1      Tom   Football
2      Tim     Skiing
3     John   Swimming
4     Alex     Tennis
5  Vanessa     Karete
6     Kate    Surfing

In [50]:
print(df)
df1 = pd.DataFrame(data = df,columns=["name", "sport", "gender", "score", "age"])
df1.rename(index={0: "one", 1: 'two', 2: "three", 3:"four", 4:"five", 5: "six", 6: "seven"}, inplace=True)
df1

      name  score      sport gender
0     Bill     90  Wrestling      M
1      Tom     80   Football      M
2      Tim     85     Skiing      M
3     John     75   Swimming      M
4     Alex     95     Tennis      F
5  Vanessa     60     Karete      F
6     Kate     65    Surfing      F

          name      sport gender  score  age
one       Bill  Wrestling      M     90  NaN
two        Tom   Football      M     80  NaN
three      Tim     Skiing      M     85  NaN
four      John   Swimming      M     75  NaN
five      Alex     Tennis      F     95  NaN
six    Vanessa     Karete      F     60  NaN
seven     Kate    Surfing      F     65  NaN

In [51]:
print(df1.loc['one'])

name           Bill
sport     Wrestling
gender            M
score            90
age             NaN
Name: one, dtype: object

In [54]:
print(df1.loc[['one', 'five']])

      name      sport gender  score  age
one   Bill  Wrestling      M     90  NaN
five  Alex     Tennis      F     95  NaN

In [56]:
my_rows = ['one', 'three', 'five', 'seven']
print(my_rows)

print(df1.loc[my_rows])

['one', 'three', 'five', 'seven']
       name      sport gender  score  age
one    Bill  Wrestling      M     90  NaN
three   Tim     Skiing      M     85  NaN
five   Alex     Tennis      F     95  NaN
seven  Kate    Surfing      F     65  NaN

In [57]:
values = [19, 20, 17, 19, 21, 18, 20]
df1["age"] = values
print(df1)

          name      sport gender  score  age
one       Bill  Wrestling      M     90   19
two        Tom   Football      M     80   20
three      Tim     Skiing      M     85   17
four      John   Swimming      M     75   19
five      Alex     Tennis      F     95   21
six    Vanessa     Karete      F     60   18
seven     Kate    Surfing      F     65   20

In [59]:
df1["pass"] = df1.score > 70
print(df1)

          name      sport gender  score  age   pass
one       Bill  Wrestling      M     90   19   True
two        Tom   Football      M     80   20   True
three      Tim     Skiing      M     85   17   True
four      John   Swimming      M     75   19   True
five      Alex     Tennis      F     95   21   True
six    Vanessa     Karete      F     60   18  False
seven     Kate    Surfing      F     65   20  False

In [60]:
print(df1.iloc[1])

name           Tom
sport     Football
gender           M
score           80
age             20
pass          True
Name: two, dtype: object

In [61]:
print(df1.iloc[[0, 2], [1, 2]])

           sport gender
one    Wrestling      M
three     Skiing      M

In [62]:
print(df1.iloc[1:3, :])

      name     sport gender  score  age  pass
two    Tom  Football      M     80   20  True
three  Tim    Skiing      M     85   17  True

In [63]:
print(df1.iloc[1:4, 0:4])

       name     sport gender  score
two     Tom  Football      M     80
three   Tim    Skiing      M     85
four   John  Swimming      M     75

In [64]:
print(data)

{'name': ['Bill', 'Tom', 'Tim', 'John', 'Alex', 'Vanessa', 'Kate'], 'score': [90, 80, 85, 75, 95, 60, 65], 'sport': ['Wrestling', 'Football', 'Skiing', 'Swimming', 'Tennis', 'Karete', 'Surfing'], 'sex': ['M', 'M', 'M', 'M', 'F', 'F', 'F']}

In [65]:
data = pd.DataFrame(
np.arange(16).reshape(4, 4), 
index = ['London', 'Paris', 'Berlin', 'Istanbul'], 
columns = ['one', 'two', 'three', 'four'])

print(data)

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [66]:
print(data[["one", "two"]])

          one  two
London      0    1
Paris       4    5
Berlin      8    9
Istanbul   12   13

In [67]:
print(data[:3])

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7
Berlin    8    9     10    11

In [68]:
print(data.iloc[1, [1, 2, 3]])

two      5
three    6
four     7
Name: Paris, dtype: int64

In [69]:
print(data.iloc[[1, 3], [1, 2, 3]])

          two  three  four
Paris       5      6     7
Istanbul   13     14    15

In [70]:
print(data.loc["Paris", ["one", "two"]])

one    4
two    5
Name: Paris, dtype: int64

In [71]:
print(data.loc[:"Paris", "four"])

London    3
Paris     7
Name: four, dtype: int64